In [1]:
import pandas as pd
import numpy as np

## Task 1: Practice with Pandas

### Task 1.1: Join/Merge three datasets together

Your task is to take three separate datasets (`grades1a.csv`, `grades1b.csv`, `grades1c.csv` -> find them in the **data** folder) and merge them together.
You may find the [documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html) helpful as it contains some visualizations to help you understand the different merges and joins that are possible.

**Restriction: There are no restrictions for this task.**

The final dataset should look like this:

### Sample Output

```
final_df
```

|    | Name             |   Student ID |   Chemistry |   Physics |   Math |
|---:|:-----------------|-------------:|------------:|----------:|-------:|
|  0 | Lila Oni         |        12001 |          59 |        90 |     45 |
|  1 | Amina Chimwala   |        12002 |          54 |        42 |     85 |
|  2 | Neda Makena      |        12003 |          42 |        88 |     54 |
|  3 | Shanthi Catrina  |        12004 |          66 |        48 |     64 |
|  4 | Deirbhile Bhavna |        12005 |          60 |        80 |     72 |
|  5 | Ige Aifric       |        12006 |          78 |        73 |     64 |
|  6 | Firouzeh Rudo    |        12007 |          64 |        43 |     67 |
|  7 | Desta Jahanara   |        12008 |          82 |        69 |     70 |
|  8 | Taiwo Sona       |        12009 |          63 |        54 |     80 |
|  9 | Fíona Finnguala  |        12010 |          41 |        52 |     70 |

In [7]:
a = pd.read_csv('data/grades1a.csv')
a

               Name  Student ID  Physics  Math
0          Lila Oni       12001       90    45
1    Amina Chimwala       12002       42    85
2       Neda Makena       12003       88    54
3   Shanthi Catrina       12004       48    64
4  Deirbhile Bhavna       12005       80    72
5        Ige Aifric       12006       73    64
6     Firouzeh Rudo       12007       43    67
7    Desta Jahanara       12008       69    70
8        Taiwo Sona       12009       54    80
9   Fíona Finnguala       12010       52    70

In [11]:
b = pd.read_csv('data/grades1b.csv')
b

   Student ID  Chemistry
0       12001         59
1       12002         54
2       12003         42
3       12004         66
4       12008         82
5       12009         63
6       12010         41

In [10]:
c = pd.read_csv('data/grades1c.csv')
c

   Student ID  Chemistry
0       12001         59
1       12003         42
2       12004         66
3       12005         60
4       12006         78
5       12007         64
6       12008         82

In [17]:
pd.merge(b,c,how='outer').merge(a,how='outer')

   Student ID  Chemistry              Name  Physics  Math
0       12001         59          Lila Oni       90    45
1       12002         54    Amina Chimwala       42    85
2       12003         42       Neda Makena       88    54
3       12004         66   Shanthi Catrina       48    64
4       12008         82    Desta Jahanara       69    70
5       12009         63        Taiwo Sona       54    80
6       12010         41   Fíona Finnguala       52    70
7       12005         60  Deirbhile Bhavna       80    72
8       12006         78        Ige Aifric       73    64
9       12007         64     Firouzeh Rudo       43    67

In [2]:
#Your Answer Here

### Task 1.2: Combine two datasets with different keys

Your task is to merge two datasets together on the "Student ID" column in `grades2a.csv` and the "SID" column in the file `grades2b.csv` (`csv` files are located in the data folder).

You can do this any way you like that matches the Sample Output (there are multiple ways of doing it) but please explain how you did it (and why).

**Restriction: There are no restrictions for this task.**

#### Sample Output

|    | Name             |   Student ID |   Chemistry |   Physics |   Math |
|---:|:-----------------|-------------:|------------:|----------:|-------:|
|  0 | Lila Oni         |        12001 |          59 |        90 |     45 |
|  1 | Amina Chimwala   |        12002 |          54 |        42 |     85 |
|  2 | Neda Makena      |        12003 |          42 |        88 |     54 |
|  3 | Shanthi Catrina  |        12004 |          66 |        48 |     64 |
|  4 | Deirbhile Bhavna |        12005 |          60 |        80 |     72 |
|  5 | Ige Aifric       |        12006 |          78 |        73 |     64 |
|  6 | Firouzeh Rudo    |        12007 |          64 |        43 |     67 |
|  7 | Desta Jahanara   |        12008 |          82 |        69 |     70 |
|  8 | Taiwo Sona       |        12009 |          63 |        54 |     80 |
|  9 | Fíona Finnguala  |        12010 |          41 |        52 |     70 |

In [5]:
#Your Answer Here

### Task 1.3: Merge dataframes and keep only overlapping rows

Often it is useful to try a bunch of different merge operations on a dataset to identify what parts of the data overlap, and what parts are disparate.
With the overlapping rows, you can then look at the value from the left, and the value from the right to compare them to see if there is any ambiguity if you chose to merge the dataframes.

In this question, you will use the same data as in Task 2 (`grades2a.csv` and `grades2b.csv`) and try to identify which rows are duplicates, or appear in both datasets.

**Restriction: For this Task, you CANNOT rename columns.**

#### Sample Output

|    | Name_x           |   Student ID |   Chemistry_x |   Physics_x |   Math_x | Name_y           |   SID |   Chemistry_y |   Physics_y |   Math_y |
|---:|:-----------------|-------------:|--------------:|------------:|---------:|:-----------------|------:|--------------:|------------:|---------:|
|  0 | Shanthi Catrina  |        12004 |            66 |          48 |       64 | Shanthi Catrina  | 12004 |            66 |          48 |       64 |
|  1 | Deirbhile Bhavna |        12005 |            60 |          80 |       72 | Deirbhile Bhavna | 12005 |            60 |          80 |       72 |
|  2 | Ige Aifric       |        12006 |            78 |          73 |       64 | Ige Aifric       | 12006 |            78 |          73 |       64 |

In [6]:
#Your Answer Here